{"difficulty": [{"title": "Are the Abyss Watchers difficult? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/4kpseq/are_the_abyss_watchers_difficult/", "body": "Be aggressive in the first phase as long as there is only the boss Abyss Watcher. When the second one arrives, wait for the third one to help you. ... They're on the easier end of the scale in terms of boss difficulty in Dark Souls 3. The first time you fight them, you might have trouble with how aggressive they can be. However, you can parry ..."}, {"title": "Why on earth do people consider the Abyss Watchers to be easy?", "href": "https://www.reddit.com/r/darksouls3/comments/qseo02/why_on_earth_do_people_consider_the_abyss/", "body": "The Abyss Watchers have been the single most frustrating boss in this entire series so far for me, a first time player who is new to the games. ... Its normal they are difficulty spike in your first run. ... I thought this was a brand new game. But apparently this is the biggest overhaul mod for Dark Souls 3 that ive EVER seen, and it looks ..."}, {"title": "Are the Abyss Watchers supposed to be such a large difficulty ... - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/pkphri/are_the_abyss_watchers_supposed_to_be_such_a/", "body": "Abyss Watchers is not hard but it's the first boss that requires classic dark souls skill and timing. Before that are Iudex Gundyr, Vordt, Crystal Sage, Curse Rotted Greatwood, and if you go this route - Deacons. All very simple and rather weak bosses with no traditional \"tough enemy\" mechanics like large stamina pools and quick movesets."}], "strategy": [{"title": "Abyss Watchers - Dark Souls 3 Wiki", "href": "https://darksouls3.wiki.fextralife.com/Abyss+Watchers", "body": "Abyss Watchers is a Boss in Dark Souls 3. Find Locations, Drops, Stats, Lore Theories, Strategy Guides and Tips on how to beat the Abyss Watchers in DS3. ... Strategy 3 (Specific Sorceries) On NG, use Great Heavy Soul Arrow in the first phase and switch to Great Soul Arrow in the second phase. On NG+, use Crystal Soul Spear throughout the fight."}, {"title": "I need tips on how to defeat the abyss watchers : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/9i1kj0/i_need_tips_on_how_to_defeat_the_abyss_watchers/", "body": "with the \"real\" abyss watcher and the second phase, always expect longer combos than the first phase. also dodge around them. the fire blasts are easiest to dodge when you're rolling to the side. the most reliable strategy is to attack one or twice, and then make sure you have enough stamina to roll or sprint away - the \"real\" abyss watcher is ..."}, {"title": "Dark Souls 3: How To Beat The Abyss Watchers - Game Rant", "href": "https://gamerant.com/dark-souls-3-beat-abyss-watchers/", "body": "The chaotic Abyss Watchers boss fight in Dark Souls 3 can be tricky. Here are some ways that you can defeat them! ... There is a lot going on, so focusing on implementing any strategy can be ..."}]}