{"difficulty": [{"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Dark Souls 3 is the culmination of FromSoftware's greatest work. It stays true to the formula they curated in the first place and pushes everything to the ... Difficulty: 4 out of 10. 16. Aldrich, Devourer of Gods. Related: how to beat aldrich, devourer of gods in dark souls 3. Aldrich spends much time vulnerable during the fight, but his ..."}, {"title": "What is Your Personal Ranking of Boss Difficulty? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/5msg4f/what_is_your_personal_ranking_of_boss_difficulty/", "body": "Aldrich, Devourer of Gods Old Demon King Dragonslayer Armour Soul of Cinder ... amounts of crack. The attacks aren't hard to dodge on their own, but his speed and non-stop combos are where the difficulty is at. 3 . ... I thought this was a brand new game. But apparently this is the biggest overhaul mod for Dark Souls 3 that ive EVER seen, and ..."}, {"title": "Updated boss difficulty tier list : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/fhl7p3/updated_boss_difficulty_tier_list/", "body": "Aldrich, Devourer of Gods Old Demon King Yhorm the Giant, either with or without Storm Ruler ... then its automatically invalidated for combat difficulty since no actual combat takes place. In that regard is how I rated all of these bosses. Reply reply ... Dark souls 3 in all honesty is peak when it came to boss design"}], "strategy": [{"title": "Dark Souls 3 Boss Co-Op Strategy guide (WIP) Spoilers ahead!", "href": "https://www.reddit.com/r/darksouls3/comments/4j7n58/dark_souls_3_boss_coop_strategy_guide_wip/", "body": "Enemies on this short list are known as \"Lords of Cinder\", and thus have a second stage where their attacks become empowered with fire, and as such you should balance your natural defenses with some fire resistant items of armor: Aldrich, Devourer of Gods. Yhorm, The Giant. Abyss Watchers. Lorian, Elder Prince and Lothric, Younger Prince."}, {"title": "Aldrich, Devourer of Gods / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=eOJuzgbUSNo", "body": "An easy guide on how to beat the Aldrich, Devourer of Gods boss fight in Dark Souls 3. This boss is located in Anor Londo.Take a gander at the video, and I'l..."}, {"title": "Dark Souls 3 Aldrich, Devourer of Gods Strategy Guide - YouTube", "href": "https://www.youtube.com/watch?v=A7ZabYu-3nQ", "body": "Dark Souls 3 Strategy guide for the boss, Aldrich, Devourer of Gods in Anor Londo.Dark Souls III playlisthttps://www.youtube.com/playlist?list=PLWtd0ISBZPcPu..."}]}