{"difficulty": [{"title": "Updated boss difficulty tier list : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/fhl7p3/updated_boss_difficulty_tier_list/", "body": "Ancient Wyvern Oceiros, the Consumed King Twin Princes, Lorian and Lothric For the most part, none of the base game bosses are difficult, just a nuisance. 1st run I died hella more to the Ancient Wyvern than Gwyn's son, and more to almost any boss than Soul of Cinder since he basically uses the same moveset as Abyss Watchers in Phase 2."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. Because of this, the difficulty will be highly subjective. The hardest boss for me may be the easiest for someone else. ... The Ancient Wyvern is given the lowest difficulty because you can end him with a single plunging attack. The ..."}, {"title": "A casual's boss difficulty ranking : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/apa2dp/a_casuals_boss_difficulty_ranking/", "body": "A community dedicated to everything about Dark Souls 3. Members Online • Chilla_Vanilla . A casual's boss difficulty ranking Guide I decided to make a brief ranking of how difficult I found the bosses of DS3 based on my first playthroughs. ... Ancient Wyvern (10/20) The biggest threat here is the big man-serpent at the end, but ultimately it ..."}], "strategy": [{"title": "How To Defeat Ancient Wyvern Boss In Dark Souls 3 - TheGamer", "href": "https://www.thegamer.com/dark-souls-3-ancient-wyvern-location-boss-fight-guide/", "body": "Ancient Wyvern is a boss in Dark Souls 3. This boss fight is optional and acts as a gimmick fight. ... The strategy for this boss is quite simple. The boss is quite strong against all kinds of status effects. However, it is weak against plunging attacks. What you need to do is make your way to the left doorway as soon as you reach the dragon ..."}, {"title": "Ancient Wyvern / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=eRFIOLMHWm4", "body": "An easy guide on how to beat the the Ancient Wyvern boss fight in Dark Soul 3. This boss is located in Archdragon Peak.Take a gander at the video, and I'll s..."}, {"title": "[Boss] Ancient Wyvern - Dark Souls III Forum - Neoseeker", "href": "https://www.neoseeker.com/forums/89204/t2187087-boss-ancient-wyvern/", "body": "» Dark Souls III » [Boss] Ancient Wyvern. strategy [Boss] Ancient Wyvern. 0. Dark Souls III PC XBOXONE PS4. walkthrough; reviews; FAQs/Guides; screens; wiki; Join Community. 171 ..."}]}