{"difficulty": [{"title": "Dark Souls 3 Bosses Ranked by Difficulty \\- Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. ... Difficulty: 3 out of 10. 18. Crystal Sage. Related: how to beat the crystal sage in dark souls 3. The Crystal Sage has killed me more times than I care to admit. His cloning mechanic always seems to trip me up, and the large ..."}, {"title": "Updated boss difficulty tier list : r/darksouls3 \\- Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/fhl7p3/updated_boss_difficulty_tier_list/", "body": "My personal list. Wolnir (Pinwheels Dad) Iudex Gundyr (Kicked my ass in my 1st playthrough but now i kick his ass) Ancient Wyvern (The chain and axe guy is the real fight here) Yhorm (His punch is the only threat in this fight) Crystal Sage (You can kill him before he goes into phase 2 if he uses soul mass) Vordt (Lightning deletes him) Deacons (if you have a shit weapon then they're acc ..."}, {"title": "When does the difficulty of an sl1 run really kick in for you guys?", "href": "https://steamcommunity.com/app/374320/discussions/0/3043857610271608450/", "body": "For me it's cathedral of the deep. Only boss I died to up until this point was crystal sage (only once), beat the abyss watchers first try, along with gundyr, vordt and greatwood. Deacons are actually pretty challening at sl1. Normally you just kinda walk up to them, hit and just take the damage cuz of how minimal it is, but here they take like 1/4 of your healthbar, so you can't do that ..."}], "strategy": [{"title": "Crystal Sage Location \\| Dark Souls 3", "href": "https://darksouls3.wiki.fextralife.com/Crystal+Sage", "body": "Crystal Sage is a Boss in Dark Souls 3. Find Locations, Drops, Stats, Lore Theories, Strategy Guides and Tips on how to beat Crystal Sage in DS3. ... Strategy 3 (Archery) Make sure to have the maximum amount of arrows and a decently upgraded bow before the battle. In the first phase stand behind the left or central pillar to avoid most of the ..."}, {"title": "How do I beat the crystal sage as a sorcerer? : r/darksouls3 \\- Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/uew5j0/how_do_i_beat_the_crystal_sage_as_a_sorcerer/", "body": "Strategy Games; Tabletop Games; Q&As. Q&As; Stories & Confessions; Technology. ... Farron Dart is a good choice to take out the clones because it's cheap and fast. Pestilent Mist will eat Crystal Sage's health while you run around, using magic shield or twisted wall of light to protect yourself from magic. ... Dark souls 3 in all honesty is ..."}, {"title": "what is the best strategy for crystal sages second phase?", "href": "https://www.reddit.com/r/darksouls3/comments/oxzewi/what_is_the_best_strategy_for_crystal_sages/", "body": "Learn the spawn points and crystal locations. Sage always spawns in one of the cardinal or intercardinal locations. Sage always spawns in the opposite quadrant from you. So if you are in the northeast quadrant, Sage will spawn at the south, west, or southwest locations. In Phase 1 , Sage spawns away from crystals. In Phase 2, Sage spawns on a ..."}]}