{"difficulty": [{"title": "A casual's boss difficulty ranking : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/apa2dp/a_casuals_boss_difficulty_ranking/", "body": "A community dedicated to everything about Dark Souls 3. ... Curse-Rotted Greatwood (10/20)- First phase is annoying at worst, but second phase can get you pretty easily with the grabs or when he spins around for really high damage. ... A lot of the difficulty depends on your routing though. For example, Sage with a +4 Weapon is a joke. Reply ..."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Dark Souls 3 is the culmination of FromSoftware's greatest work. It stays true to the formula they curated in the first place and pushes everything to the ... Difficulty: 2.5 out of 10. 19. Curse-Rotted Greatwood. Related: how to beat the curse-rotted greatwood in dark souls 3. This living tree is yet another gimmick boss in Dark Souls 3, but ..."}, {"title": "Hardest Bosses in Dark Souls 3 - MSN", "href": "https://www.msn.com/en-us/gaming/other/hardest-bosses-in-dark-souls-3/ar-AA1eUUw2", "body": "The Dark Souls series is notorious for its difficulty, and these Dark Souls 3 bosses are prime examples of why that is. ... The Curse-Rotted Greatwood, High Lord Wolnir, Vordt of the Boreal Valley ..."}], "strategy": [{"title": "Dark Souls 3 Curse-rotted Greatwood Strategy Guide - YouTube", "href": "https://www.youtube.com/watch?v=6vNCBcnjxL4", "body": "Dark Souls 3 Strategy guide for the boss, Curse-rotted Greatwood at the Undead Settlement.Dark Souls III playlisthttps://www.youtube.com/playlist?list=PLWtd0..."}, {"title": "Dark Souls 3- Curse-rotted Greatwood Boss Strategy Guide", "href": "https://www.youtube.com/watch?v=ECo-NkM3WmY", "body": "This is my boss strategy guide for the Curse-rotted Greatwood who is the third boss in Dark Souls 3.New videos will be posted every day covering a wide varie..."}, {"title": "Dark Souls 3: 6 Bosses Weak To Fire - Game Rant", "href": "https://gamerant.com/dark-souls-3-bosses-weak-to-fire/", "body": "Dark Souls 3 has some interesting status effects players can take advantage of. ... and combining it with a Fire Gem to deal fire damage to the Curse-Rotted Greatwood is a great strategy to make ..."}]}