{"difficulty": [{"title": "Is it me, or is the dancer of the boreal valley just the biggest ...", "href": "https://www.reddit.com/r/darksouls3/comments/mnt2g5/is_it_me_or_is_the_dancer_of_the_boreal_valley/", "body": "A community dedicated to everything about Dark Souls 3. Members Online • mike_exe_ ADMIN MOD Is it me, or is the dancer of the boreal valley just the biggest difficulty spike in the game? I'm a long time fan of the souls series, with more than 300 hours spent in DS1 and having beat the original Demons Souls a couple of times, I decided to ..."}, {"title": "Is Dancer of the boreal valley Really the hardest boss in the ... - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/pwfxq9/is_dancer_of_the_boreal_valley_really_the_hardest/", "body": "Is Dancer of the boreal valley Really the hardest boss in the main game because I died to her 3 times and dark souls 3 is the first souls game that I actually finished ... Comparing Bed of Chaos rage puzzle difficulty on first playthrough to darkeater Midir are completely different types of challenges. ... imagine it's 2016 and dark souls 3 ..."}, {"title": "Dark souls 3 the dancer boreal valley difficulty levels ridiculous ...", "href": "https://gamefaqs.gamespot.com/ps4/168566-dark-souls-iii/answers/426464-dark-souls-3-the-dancer-boreal-valley-difficulty-levels-ridiculous-12hrs-and", "body": "For Dark Souls III on the PlayStation 4, a GameFAQs Q&A question titled \"Dark souls 3 the dancer boreal valley difficulty levels ridiculous 12hrs and still havent beat her am i the only one?\"."}], "strategy": [{"title": "Dancer of the Boreal Valley SL1 Strategy guide (No cheese)", "href": "https://www.reddit.com/r/darksouls3/comments/4ik2pz/dancer_of_the_boreal_valley_sl1_strategy_guide_no/", "body": "As far as spells go, Carthus flame arc gives you a good chunk of damage and is definitely worth using. You can get 3 casts with base FP and it's free damage. Strategy The main challenge I found in this fight was being patient and waiting till the right time to dodge. Her strange movements and oddly delayed attacks take some getting used to so ..."}, {"title": "Dancer of the Boreal Valley strategy : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/99mat1/dancer_of_the_boreal_valley_strategy/", "body": "In 3 playthroughs of DS3, I'm 3-1 against the Dancer, having only suffered a single death my 3rd time through. Her attacks are pretty easy to read, I've always just tried to keep a little bit of distance and wait for her to finish attacking before trying to get in a hit."}, {"title": "I had a hard time finding a powerful strategy for dancer of boreal valley", "href": "https://www.reddit.com/r/darksouls3/comments/1dm59bi/i_had_a_hard_time_finding_a_powerful_strategy_for/", "body": "This strategy lets miracle workers to easily defeat the difficult dancer of boreal valley, first, you want to get the spell gnaw, you get this from the blind miracle woman, this spell is underlooked by many, but it has great bleed capabilities, the dancer cannot be poisoned or frostbitten, but she is susceptible to bleed."}]}