{"difficulty": [{"title": "Are The Deacons of the Deep Supposed to Be Easy? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/s03rdx/are_the_deacons_of_the_deep_supposed_to_be_easy/", "body": "Come back to them at like NG+6 and it's a different story. I feel like their difficulty spikes when you start getting into the NG+5 and up just because it takes more than a few hits to kill each deacon and if you're not careful you can get surrounded and pounded pretty easily."}, {"title": "A few people were concerned regarding the difficulty of the Deacons of ...", "href": "https://www.reddit.com/r/darksouls3/comments/sldy7z/a_few_people_were_concerned_regarding_the/", "body": "95 votes, 18 comments. 564K subscribers in the darksouls3 community. A community dedicated to everything about Dark Souls 3. Advertisement Coins. 0 coins. Premium Powerups Explore Gaming. Valheim ... A few people were concerned regarding the difficulty of the Deacons of the Deep for my all attributes 1 challenge run. One even declared that it ..."}, {"title": "Deacons of the Deep as a caster/pyro - Dark Souls III - GameFAQs", "href": "https://gamefaqs.gamespot.com/boards/168566-dark-souls-iii/73615557", "body": "For Dark Souls III on the PlayStation 4, a GameFAQs message board topic titled \"Deacons of the Deep as a caster/pyro\". ... Thanks guys. I completely gave up on casting and used Carthus Flame Arc on a Falchion and beat it first try with little difficulty.:) Boards; Dark Souls III; Deacons of the Deep as a caster/pyro; Topic Archived; Page 1 of 2 ..."}], "strategy": [{"title": "Deacons of the Deep - Dark Souls 3 Guide - IGN", "href": "https://www.ign.com/wikis/dark-souls-3/Deacons_of_the_Deep", "body": "The Deacons of the Deep are likely the fifth of the many Bosses you'll contend with in Dark Souls 3. The Deacons of the Deep are ... however they are resistant to Pyromancy and Dark. Battle Strategy"}, {"title": "Deacons of the Deep / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=Le91t9XfNns", "body": "How to beat the Deacons of the Deep boss fight in Dark Souls 3. This boss is found in Cathedral of the Deep.I'll show you some strategies and tactics you can..."}, {"title": "Dark Souls 3 Deacons of the Deep Strategy Guide - YouTube", "href": "https://www.youtube.com/watch?v=3Bm0w1WkQxM", "body": "Dark Souls 3 Strategy guide for the boss, Deacons of the Deep at the Cathedral of the Deep.Dark Souls III playlisthttps://www.youtube.com/playlist?list=PLWtd..."}]}