{"difficulty": [{"title": "Why is Dragonslayer Armor so easy? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/z17ko4/why_is_dragonslayer_armor_so_easy/", "body": "Ironically I had far more problems with these guys than Dragonslayer Armor. He does hit hard, but so do all bosses, really. But he is very slow and telegraphed. ... DSA is an average difficulty boss, but experiences differ between players. ... Dark souls 3 in all honesty is peak when it came to boss design"}, {"title": "Souls series virgin boss difficulty ranking (DS3) (easiest to ... - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/rr1ca7/souls_series_virgin_boss_difficulty_ranking_ds3/", "body": "Souls series virgin boss difficulty ranking (DS3) (easiest to hardest) ... Dragonslayer armor wasn't as tough because eventually I figured that rolling away was a bad idea and getting behind would work better. I died a few times but I never felt it was unfair, like with Pontiff. ... A community dedicated to everything about Dark Souls 3."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. Because of this, the difficulty will be highly subjective. The hardest boss for me may be the easiest for someone else. ... Dragonslayer Armor. Related: how to beat dragonslayer armour in dark souls 3. Dragonslayer Armor is a fun boss ..."}], "strategy": [{"title": "How To Beat Dragonslayer Armour in Dark Souls 3 - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-how-to-beat-dragonslayer-armour/", "body": "The Dragonslayer Armour is not an optional boss.He must be defeated to gain access to the Grand Archives. Strategies for Defeating Dragonslayer Armour. Here are some strategies for defeating Dragonslayer Armour you can use depending on the build you opted for in Dark Souls 3:. Melee Strategy"}, {"title": "Dragonslayer Armour - Dark Souls 3 Guide - IGN", "href": "https://www.ign.com/wikis/dark-souls-3/Dragonslayer_Armour", "body": "The animate suit of armor known as the Dragonslayer Armour is one of the main Bosses in Dark Souls 3. The Dragonslayer Armor is located ... damage from Lightning and Dark damage. Melee Battle Strategy"}, {"title": "Dragonslayer Armour / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=lAxB5xG1ttE", "body": "An easy guide on how to beat the Dragonslayer Armour boss fight in Dark Souls 3. This boss is located in Lothric Castle.Take a gander at the video, and I'll ..."}]}