{"difficulty": [{"title": "Does the difficulty level go up when you kill high lord wolnir..? - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/k5jw36/does_the_difficulty_level_go_up_when_you_kill/", "body": "Killed that high lord skele boss earlier and all of a sudden the next areas I can go just seem impossible. I wouldn't say its been easy up until now but it feels like smouldering lake and irithyll are are HUGE step up in difficulty? Just keep dying constantly and can barely get anywhere in either of the areas."}, {"title": "A casual's boss difficulty ranking : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/apa2dp/a_casuals_boss_difficulty_ranking/", "body": "A community dedicated to everything about Dark Souls 3. Members Online • Chilla_Vanilla . A casual's boss difficulty ranking Guide I decided to make a brief ranking of how difficult I found the bosses of DS3 based on my first playthroughs. ... High Lord Wolnir (8/20) The only thing in this fight is that the smoke makes it pretty difficult to ..."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. Because of this, the difficulty will be highly subjective. The hardest boss for me may be the easiest for someone else. ... Difficulty: .5 out of 10. 24. High Lord Wolnir. Related: how to beat high lord wolnir in dark souls 3."}], "strategy": [{"title": "Dark Souls 3: High Lord Wolnir Weaknesses & Strategy", "href": "https://www.zleague.gg/theportal/beat-high-lord-wolnir/", "body": "High Lord Wolnir is a memorable boss in Dark Souls III. Players encounter this colossal skeleton deep within the Catacombs of Carthus. Adorned with jewelry and tattered remnants of clothing, Wolnir's appearance hints at a past grandeur, now a haunting spectacle of decay."}, {"title": "High Lord Wolnir / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=xG7-YRLNDyQ", "body": "An easy guide on how to beat the High Lord Wolnir boss fight in Dark Souls 3. The infamous skeleton boss is found in the Catacombs of Carthus.Take a gander a..."}, {"title": "How To Beat High Lord Wolnir in Dark Souls 3 - Game Voyagers", "href": "https://gamevoyagers.com/how-to-beat-high-lord-wolnir-in-dark-souls-3/", "body": "High Lord Wonir is not an optional boss in Dark Souls 3.He has to be taken down to further explore Irithyll of the Boreal Valley.. Strategies for Defeating High Lord Wolnir. Here are some strategies for defeating High Lord Wolnir you can use depending on the build you opted for in Dark Souls 3:. Melee Strategy"}]}