{"difficulty": [{"title": "A casual's boss difficulty ranking : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/apa2dp/a_casuals_boss_difficulty_ranking/", "body": "A community dedicated to everything about Dark Souls 3. Members Online • Chilla_Vanilla . A casual's boss difficulty ranking Guide I decided to make a brief ranking of how difficult I found the bosses of DS3 based on my first playthroughs. ... Iudex Gundyr (11/20)- In first phase he can be a bit unpredictable and hits relatively hard, second ..."}, {"title": "Why is Dark Souls 3 first boss so hard? - NCESC", "href": "https://www.ncesc.com/gaming-pedia/why-is-dark-souls-3-first-boss-so-hard/", "body": "The first boss in Dark Souls 3, Iudex Gundyr, is considered difficult for several reasons. Firstly, he subverts expectations by having multiple phases and a complex attack pattern. ... The difficulty of this boss sets the tone for the rest of the game and prepares players for the challenges to come. What makes Iudex Gundyr challenging?"}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Dark Souls 3 is the culmination of FromSoftware's greatest work. It stays true to the formula they curated in the first place and pushes everything to the ... Difficulty: 2 out of 10. 20. Iudex Gundyr. Related: how to beat iudex gundyr in dark souls 3. You'd think the first boss in the game would be the easiest, but that isn't the case with ..."}], "strategy": [{"title": "How To Beat Iudex Gundyr in Dark Souls 3 (Ultimate Guide)", "href": "https://gamevoyagers.com/how-to-beat-iudex-gundyr-in-dark-souls-3-ultimate-guide/", "body": "Iudex Gundyr is the first boss in Dark Souls 3 and is not an optional boss.He has to be defeated in order to access the Firelink Shrine.. Strategies for Defeating Iudex Gundyr. Here are some strategies for defeating Iudex Gundyr you can use depending on the build you opted for in Dark Souls 3:. Melee Strategy"}, {"title": "Dark Souls 3 Iudex Gundyr Strategy Guide • Cemetery of Ash Boss", "href": "https://www.youtube.com/watch?v=b8Stv4XVkWM", "body": "Dark Souls 3 Strategy guide for the boss, Iudex Gundyr in the Cemetery of Ash.Dark Souls III playlisthttps://www.youtube.com/playlist?list=PLWtd0ISBZPcPuio93..."}, {"title": "Iudex Gundyr - Dark Souls 3 Guide - IGN", "href": "https://www.ign.com/wikis/dark-souls-3/Iudex_Gundyr", "body": "The menacing Iudex Gundyr is the first of many Bosses you will face in Dark Souls 3. Iudex Gundyr is the first boss of the game and impossible ... An alternative melee strategy is to act more like ..."}]}