{"difficulty": [{"title": "Dark Souls 3 Guide: How to Beat the Twin Princes Easily - Game Rant", "href": "https://gamerant.com/dark-souls-3-twin-princes-guide-216/", "body": "Having difficulty taking down the twin princes Lorian and Lothric in Dark Souls 3? Then look no further than this guide on how to defeat this troublesome duo. ... Elder Prince and Lothric, Younger ..."}, {"title": "my # of attempts (difficulty ranking?) of notable DS3 and DS3 DLC ...", "href": "https://steamcommunity.com/app/374320/discussions/0/4299320559086643569/", "body": "I used a dexterity build. Typically the Uchigatana or Washing pole as my weapon. No summons were used. I solo'd them. Hardest for me: Twin princes: Lothric, Younger Prince - 60 attempts. Second hardest: Nameless King - 37 attempts Notable mentions: Darkeater Midir - 35 attempts. Surprisingly easy: Kiln of the First Flame - 1st first. Played him almost immediately after my victory of the twin ..."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Dark Souls 3 is the culmination of FromSoftware's greatest work. It stays true to the formula they curated in the first place and pushes everything to the ... Difficulty: 7 out of 10. 10. Lothric, Younger Prince. Related: how to beat lothric, younger prince in dark souls 3. This fight isn't like the others where you can stay far away from him ..."}], "strategy": [{"title": "How To Beat Lothric, Younger Prince in Dark Souls 3", "href": "https://gamevoyagers.com/how-to-beat-lothric-younger-prince-in-dark-souls-3/", "body": "Lothric, Younger Prince is not an optional boss. He must be dealt with in order to progress. Strategies for Defeating Lothric, Younger Prince. Here are some strategies for defeating Lothric, Younger Prince you can use depending on the build you opted for in Dark Souls 3: Melee Strategy. In phase 1, you will face only Lorian."}, {"title": "Lothric, Younger Prince / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=19zCKa1ngLY", "body": "An easy guide on how to beat The Twin Princes boss fight in Dark Soul 3, Lothric, Younger Prince and Lorian, Elder Prince.Take a gander at the video, and I'l..."}, {"title": "All Dark Souls 3 Bosses In Order - Game Rant", "href": "https://gamerant.com/dark-souls-3-ds3-all-bosses-in-order/", "body": "Dark Souls 3 features 25 unique and challenging bosses, each offering special rewards upon defeat while deepening the game's rich lore. ... patience, and strategy. ... Lothric, Younger Prince ..."}]}