{"difficulty": [{"title": "Is The Nameless King's Difficulty Over Hyped? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/gn8s9h/is_the_nameless_kings_difficulty_over_hyped/", "body": "(I miss that in Dark Souls.) I had a long range axe or a big sword that I could transform into a fast sword. In Demon's Souls I had the help of magic. In DS3 I started as a strengh build but changed it to a quality build to try new (and faster weapons) because I simply was to slow for the later bosses (Lothric and Lorian and Nameless King)."}, {"title": "Why do people say that the nameless king is so hard?", "href": "https://www.reddit.com/r/darksouls3/comments/6ik5h5/why_do_people_say_that_the_nameless_king_is_so/", "body": "I find Nameless King easy with an ultra Grestsword but very tough with on a faith build. I find Dancer easier than Yhorm with a Pyro build but hard as nails with a Dex one. ... much like every other difficult boss in Dark Souls 3. I personally find it a bit overrated in terms of difficulty, but it's still a great fight. Reply reply"}, {"title": "Nameless King's difficulty is overrated : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/fm1fc8/nameless_kings_difficulty_is_overrated/", "body": "Nameless King's difficulty is overrated . Discussion ... I personally find king of storms hard but nameless himself is hard Reply reply ... Which boss in Dark Souls 3 was so challenging that it compelled you to summon another player for assistance? upvotes ..."}], "strategy": [{"title": "Nameless King Strategy : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/4jjtzr/nameless_king_strategy/", "body": "The nameless king is a perfect distillation of the quality game play fundamentals that makes Dark Souls punishing and rewarding. In a few words: he forces you to get good. All of his attacks are fairly telegraphed, and do fair damage for an end game boss."}, {"title": "How To Beat The Nameless King in Dark Souls 3 - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-how-to-beat-the-nameless-king/", "body": "The Nameless King is an optional boss. Strategies for Defeating The Nameless King. Here are some strategies for defeating The Nameless King you can use depending on the build you opted for in Dark Souls 3: Melee Strategy. When the fight starts the Nameless King will swoop in on King of the Storm, his dragon."}, {"title": "Dark Souls 3 Guide: How to Beat the Nameless King Boss - Game Rant", "href": "https://gamerant.com/dark-souls-3-guide-nameless-king/", "body": "With enough persistence and patience, the Nameless King will be defeated with this strategy. Again, he is one of the tougher bosses in Dark Souls III , so go in expecting a stiff challenge."}]}