{"difficulty": [{"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. Because of this, the difficulty will be highly subjective. The hardest boss for me may be the easiest for someone else. ... Difficulty: 3.5 out of 10. 17. Oceiros, the Consumed King. Related: how to beat oceiros, the consumed king in ..."}, {"title": "Hardest Bosses in Dark Souls 3 - MSN", "href": "https://www.msn.com/en-us/gaming/other/hardest-bosses-in-dark-souls-3/ar-AA1eUUw2", "body": "Tips For Defeating Oceiros, The Consumed King . ... Dark Souls 3: The 10 Hardest Zones Ranked By Difficulty. Dark Souls 3 isn't an easy journey, but these areas are harder than most, where players ..."}, {"title": "Dark Souls 3 Bosses Ranked Weakest to Strongest", "href": "https://www.gamersdecide.com/articles/dark-souls-3-bosses-ranked", "body": "All Dark Souls 3 Bosses in the game ranked. Information for new or returning players. ... 15. Oceiros, the Consumed King. Image. Our second dragon on the list. He is a bit preoccupied looking for his child, but has no problem taking out his frustrations on you! ... 80,000 souls; Soul of The Nameless King. Difficulty rating: 90/100. 2. Sister ..."}], "strategy": [{"title": "Dark Souls 3: How To Beat Oceiros, The Consumed King - Game Rant", "href": "https://gamerant.com/dark-souls-3-beat-oceiros-the-consumed-king-guide/", "body": "Despite being able to curse the player, Oceiros, the Consumed King is a Dark Souls 3 boss that can be beaten with little trouble using these tactics. ... Melee Strategy #1 - Use A Lightning Weapon ..."}, {"title": "Dark Souls 3 In-depth Look at Lore and Strategy - 31 - Oceiros the ...", "href": "https://www.youtube.com/watch?v=jkXROR5eYbk", "body": "Dark Souls 3 In-depth takes a closer look at the lore, strategy, oddities, and helpful hints for beating Oceiros, the Consumed King within the Consumed King'..."}, {"title": "Dark Souls III: Oceiros, The Consumed King Easy Strategy/Cheese", "href": "https://www.youtube.com/watch?v=x4XXpb0A1Hc", "body": "Put daddy in timeout."}]}