{"difficulty": [{"title": "Updated boss difficulty tier list : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/fhl7p3/updated_boss_difficulty_tier_list/", "body": "Easiest to Hardest Ancient Wyvern Judex Gundyr Curse Rotted Greatwood Wolnir Deacons of the Deep Yhorm the Giant Vordt of the Boreal Valley Crystal Sage Abyss Watchers Old Demon King Oceiros, the Consumed King Dragonslayer Armour Aldrich, Devourer of Gods Pontiff Sulyvahn Champion Gundyr Dancer of the Boreal Valley Lothric and Lorian, the Twin Princes Soul of Cinder Nameless King"}, {"title": "Ranking the Dark Souls III Boss Difficulty With DLC : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/aurezb/ranking_the_dark_souls_iii_boss_difficulty_with/", "body": "Number 17 - Old Demon King (0 Deaths). ... Sorry it's so long, but this is my ranking of the Dark Souls III boss difficulty. Let me know what you think, it's always interesting to see other people's rankings (As long as they don't say the Dancer is the hardest boss in the base game, or Fume Knight is the fourth hardest boss in the series). ..."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. Because of this, the difficulty will be highly subjective. The hardest boss for me may be the easiest for someone else. ... Difficulty: 4.5 out of 10. 15. Old Demon King. Related: how to beat the old demon king in dark souls 3."}], "strategy": [{"title": "Is there a reliable strategy to beat the Old Demon King?", "href": "https://www.reddit.com/r/darksouls3/comments/cyi8it/is_there_a_reliable_strategy_to_beat_the_old/", "body": "A community dedicated to Dark Souls 2, game released for PC, PlayStation 3 and 4, Xbox 360 and One. Members Online Mods should sticky Blobertson's post about removing hacked items"}, {"title": "Old Demon King / Boss Guide / Dark Souls 3 / Simple Strategy ...", "href": "https://www.youtube.com/watch?v=ew5XSbjf5fE", "body": "An easy guide on how to beat the Old Demon King boss fight in Dark Souls 3. This boss is found in the Smouldering Lake.Take a gander at the video, and I'll s..."}, {"title": "Dark Souls 3 Old Demon King Strategy Guide - YouTube", "href": "https://www.youtube.com/watch?v=g1nnhNyvDjc", "body": "Dark Souls 3 Strategy guide for the boss, Old Demon King at the Smouldering Lake.Dark Souls III playlisthttps://www.youtube.com/playlist?list=PLWtd0ISBZPcPui..."}]}