{"difficulty": [{"title": "Pontiff Sulyvahn difficulty overhyped? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/9w5d6p/pontiff_sulyvahn_difficulty_overhyped/", "body": "Pontiff Sulyvahn difficulty overhyped? Discussion Hi, I'm not trying to sound like an asshole, just putting that out there. Also, he wasn't easy. He was pretty hard. But honestly, I kept hearing people say about the legendary difficulty of the boss and how he is one of the hardest. ... Dark souls 3 in all honesty is peak when it came to boss ..."}, {"title": "Why is Pontiff Sulyvahn apparently so hard? : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/mfmgzt/why_is_pontiff_sulyvahn_apparently_so_hard/", "body": "A community dedicated to everything about Dark Souls 3. ... That being said I beat pontiff Sulyvahn on my first try and he was pretty easy and I think I'm too good for this game. ... and second I kinda let go of the stigma and the difficulty attached to it and decided I'm gonna apply my own worth to this fight it was hard but not like the ..."}, {"title": "Dark Souls 3: How to Beat Pontiff Sulyvahn - zleague.gg", "href": "https://www.zleague.gg/theportal/beat-pontiff-sulyvahn/", "body": "Lore and Significance. Beyond the brutal difficulty, Pontiff Sulyvahn is a fascinating character steeped in Dark Souls lore. He cuts a striking figure, clad in tattered ceremonial robes, a crown atop his head, and a distinctive necklace of eye rings, as described on the Dark Souls wiki.But there's more to him than just his imposing appearance."}], "strategy": [{"title": "Pontiff Sulyvahn Strategy Guide: Mastering the Duel", "href": "https://toxigon.com/pontiff-sulyvahn-strategy-guide", "body": "If you're reading this, you're probably at that point in Dark Souls 3 where you're staring down the Pontiff Sulyvahn, wondering how the heck you're supposed to take down this dual-wielding menace. I remember my first encounter with him back in 2016, and let me tell you, it was a nightmare."}, {"title": "SL1 Guide : Pontiff Sulyvahn, No parry method : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/4jyhia/sl1_guide_pontiff_sulyvahn_no_parry_method/", "body": "Strategy for phase 1:As cool as it is tp parry and destroy this guy, I don't recommend it due to the amount of damage you take on partials in this game, the biggest revelation for me in this fight was to basically use the \"Vendrick method\" i.e. just hug his right armpit and almost nothing will hit you, this seems impossible, but watch the video ..."}, {"title": "How To Beat Pontiff Sulyvahn in Dark Souls 3 - Game Voyagers", "href": "https://gamevoyagers.com/how-to-beat-pontiff-sulyvahn-in-dark-souls-3/", "body": "Pontiff Sulyvahn is not an optional boss in Dark Souls 3. He needs to be defeated to further venture into Irithyll. Strategies for Defeating Pontiff Sulyvahn. Here are some strategies for defeating Pontiff Sulyvahn you can use depending on the build you opted for in Dark Souls 3: Melee Strategy. Pontiff Sulyvahn is not for the faint of heart."}]}