{"difficulty": [{"title": "what's the consensus on the difficulty of soul of cinder - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/zzliax/whats_the_consensus_on_the_difficulty_of_soul_of/", "body": "An old post I know. But I just beat him in my first try on my first play through :) I am pretty new to the souls series having only beaten Elden ring before this. I am just happy about it that's all. My first dark souls 3 boss I beat in the first try"}, {"title": "Why does no one talk about The Soul of Cinder's difficulty level?", "href": "https://www.reddit.com/r/darksouls3/comments/zr0vxc/why_does_no_one_talk_about_the_soul_of_cinders/", "body": "First time playing dark souls 3. I've beaten every boss (including DLC) and just got to the soul of cinder for the first time. I've seen a lot of discussions about the hardest boss in the game and never once have seen him mentioned. Expecting a cakewalk I proceeded to get destroyed about a dozen times. So what gives??"}, {"title": "Soul of Cinder difficulty. :: DARK SOULS™ III General Discussions", "href": "https://steamcommunity.com/app/374320/discussions/0/357286119114869881/", "body": "Dark souls final bosses are rarely difficult, but they're special for other things. gwyn was special because of how somber the entire experience felt. Nashandra was special because she was irritating (she wasn't really that special), and the soul of cinder was special because you cant breathe in the fight because the air is so thick with nostalgia."}], "strategy": [{"title": "Soul of Cinder Boss Guide: Dark Souls 3 Strategies", "href": "https://www.zleague.gg/theportal/beat-soul-of-cinder/", "body": "Conquer the Soul of Cinder in Dark Souls 3! Learn effective strategies, attack patterns, lore, and advanced techniques. Prepare for the ultimate showdown! ... What's the best strategy for the second phase of the fight? The Soul of Cinder gets a serious power boost in the second phase, so staying on the offensive is crucial. Don't let up!"}, {"title": "How To Beat The Soul of Cinder in Dark Souls 3 - Game Voyagers", "href": "https://gamevoyagers.com/how-to-beat-the-soul-of-cinder-in-dark-souls-3/", "body": "Soul of Cinder is not an optional boss and must be defeated to end the base version of Dark Souls 3.. Strategies for Defeating Soul of Cinder. Here are some strategies for defeating Soul of Cinder you can use depending on the build you opted for in Dark Souls 3:. Melee Strategy"}, {"title": "Best armor set and strategy for Soul of Cinder : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/eeads7/best_armor_set_and_strategy_for_soul_of_cinder/", "body": "So recently I started playing DS3 i am a Bloodborne veteran so I was playing without a shield only with a lighting longsword recently and when I came across Soul of Cinder I just felt like I crashed against a wall though he is not such a big challenge while he is wielding the staff or the greatsword I struggle with dodging most of his spear attacks and with finding hit-windows while he is ..."}]}