{"difficulty": [{"title": "Took me 10 hours to beat Vordt of the Boreal Valley : r/darksouls3 - Reddit", "href": "https://www.reddit.com/r/darksouls3/comments/fqa8q2/took_me_10_hours_to_beat_vordt_of_the_boreal/", "body": "And 2 weeks for Vordt, I didnt want to seem like I was flexing on OP though. The games difficulty was far far steeper than I anticipated. Combine this with no experience (first souls like) and it was hell for a bit there. Dont worry though, I definately got better. I killed Nameless King in 6 attempts and Midir in (less than 10, I cant recall ..."}, {"title": "How To Beat Vordt of the Boreal Valley in Dark Souls 3", "href": "https://gamevoyagers.com/how-to-beat-vordt-of-the-boreal-valley-in-dark-souls-3/", "body": "Vordt of the Boreal Valley in Dark Souls 3 can be considered the second boss of the game. This is also the first time you may encounter the Frostbite status effect in the game. ... Dark Souls 3 Bosses Ranked by Difficulty. Let's take a look at the best strategies and fighting tactics for taking down Vordt of the Boreal Valley in Dark Souls 3."}, {"title": "Dark Souls 3 Bosses Ranked by Difficulty - Game Voyagers", "href": "https://gamevoyagers.com/dark-souls-3-bosses-ranked-difficulty/", "body": "Let us see where bosses are ranked difficulty-wise in Dark Souls 3. Related: The Best Weapons in Dark Souls 3. Because of this, the difficulty will be highly subjective. The hardest boss for me may be the easiest for someone else. ... Vordt of the Boreal Valley. Related: how to beat vordt of the boreal valley in dark souls 3."}], "strategy": [{"title": "How To Beat Vordt of the Boreal Valley in Dark Souls 3", "href": "https://gamevoyagers.com/how-to-beat-vordt-of-the-boreal-valley-in-dark-souls-3/", "body": "You must defeat Vordt of the Boreal Valley in Dark Souls 3 to progress to the Undead Settlement. He is not optional.. Strategies for Defeating Vordt of the Boreal Valley. Here are some strategies for defeating Vordt that you can use depending on the build you opted for in Dark Souls 3:. Melee Strategy"}, {"title": "Dark Souls 3 Vordt of Boreal Valley Strategy Guide - YouTube", "href": "https://www.youtube.com/watch?v=U7eMQWaNgfY", "body": "Dark Souls 3 Strategy guide for the boss, Vordt of Boreal Valley at the High Wall of Lothric.Dark Souls III playlisthttps://www.youtube.com/playlist?list=PLW..."}, {"title": "Vordt of the Boreal Valley - Dark Souls 3 boss guide - Page 3 - GamesRadar+", "href": "https://www.gamesradar.com/dark-souls-3-boss-guide-walkthrough/3/", "body": "Vordt of the Boreal Valley Dark Souls 3 Bosses Iudex Gundyr ... Doggerland review: \"A delicate dance of survival and management that doesn't feel weighted toward a single strategy\" 2."}]}